test57-ebs-wl-2-vol-plain-vs-aesni-15min-2012_03_13_02_05/aesni-fio.out
aesni-read: (g=0): rw=randread, bs=16K-16K/16K-16K, ioengine=libaio, iodepth=2
aesni-write: (g=0): rw=randwrite, bs=16K-16K/16K-16K, ioengine=libaio, iodepth=2
aesni-read: (g=0): rw=randread, bs=16K-16K/16K-16K, ioengine=libaio, iodepth=2
aesni-write: (g=0): rw=randwrite, bs=16K-16K/16K-16K, ioengine=libaio, iodepth=2
fio 2.0.3
Starting 4 processes

aesni-read: (groupid=0, jobs=1): err= 0: pid=27848
  read : io=360032KB, bw=409628 B/s, iops=25 , runt=900017msec
    slat (usec): min=12 , max=94271 , avg=32.90, stdev=656.44
    clat (usec): min=390 , max=236647 , avg=11862.47, stdev=11040.43
     lat (usec): min=417 , max=236676 , avg=11896.78, stdev=11066.21
    clat percentiles (usec):
     |  1.00th=[  434],  5.00th=[ 3120], 10.00th=[ 4128], 20.00th=[ 5664],
     | 30.00th=[ 7008], 40.00th=[ 8160], 50.00th=[ 9152], 60.00th=[10304],
     | 70.00th=[11840], 80.00th=[14272], 90.00th=[21632], 95.00th=[33024],
     | 99.00th=[55040], 99.50th=[67072], 99.90th=[115200]
    bw (KB/s)  : min=  267, max=  533, per=25.01%, avg=400.12, stdev=22.11
    lat (usec) : 500=1.30%, 750=0.11%, 1000=0.01%
    lat (msec) : 2=0.21%, 4=7.71%, 10=48.09%, 20=31.41%, 50=9.63%
    lat (msec) : 100=1.41%, 250=0.13%
  cpu          : usr=0.04%, sys=0.27%, ctx=44208, majf=0, minf=58
  IO depths    : 1=96.5%, 2=3.5%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=22502/w=0/d=0, short=r=0/w=0/d=0
aesni-write: (groupid=0, jobs=1): err= 0: pid=27849
  write: io=1054.8MB, bw=1200.5KB/s, iops=75 , runt=900004msec
    slat (usec): min=18 , max=4635 , avg=33.57, stdev=40.17
    clat (usec): min=215 , max=222001 , avg=3202.87, stdev=8526.18
     lat (usec): min=410 , max=222034 , avg=3237.90, stdev=8526.74
    clat percentiles (usec):
     |  1.00th=[  422],  5.00th=[  438], 10.00th=[  450], 20.00th=[  458],
     | 30.00th=[  462], 40.00th=[  466], 50.00th=[  482], 60.00th=[  548],
     | 70.00th=[  956], 80.00th=[ 2992], 90.00th=[ 6624], 95.00th=[15040],
     | 99.00th=[46336], 99.50th=[51968], 99.90th=[76288]
    bw (KB/s)  : min=  670, max= 1742, per=75.08%, avg=1201.24, stdev=61.22
    lat (usec) : 250=0.01%, 500=53.47%, 750=13.42%, 1000=4.16%
    lat (msec) : 2=5.27%, 4=7.15%, 10=9.96%, 20=2.47%, 50=3.48%
    lat (msec) : 100=0.58%, 250=0.04%
  cpu          : usr=0.15%, sys=0.72%, ctx=129980, majf=0, minf=52
  IO depths    : 1=90.0%, 2=10.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=67503/d=0, short=r=0/w=0/d=0
aesni-read: (groupid=0, jobs=1): err= 0: pid=27850
  read : io=1054.8MB, bw=1200.3KB/s, iops=75 , runt=900019msec
    slat (usec): min=11 , max=15959 , avg=23.56, stdev=61.65
    clat (usec): min=302 , max=171576 , avg=11470.79, stdev=10651.68
     lat (usec): min=382 , max=171604 , avg=11495.69, stdev=10651.63
    clat percentiles (usec):
     |  1.00th=[  410],  5.00th=[ 2800], 10.00th=[ 3600], 20.00th=[ 5088],
     | 30.00th=[ 6432], 40.00th=[ 7648], 50.00th=[ 8768], 60.00th=[ 9920],
     | 70.00th=[11456], 80.00th=[14272], 90.00th=[20096], 95.00th=[35072],
     | 99.00th=[54528], 99.50th=[61696], 99.90th=[87552]
    bw (KB/s)  : min=  770, max= 1848, per=75.07%, avg=1201.14, stdev=79.76
    lat (usec) : 500=1.83%, 750=0.13%, 1000=0.04%
    lat (msec) : 2=0.33%, 4=10.25%, 10=48.20%, 20=29.10%, 50=8.59%
    lat (msec) : 100=1.49%, 250=0.06%
  cpu          : usr=0.18%, sys=0.59%, ctx=116621, majf=0, minf=59
  IO depths    : 1=73.1%, 2=26.9%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=67503/w=0/d=0, short=r=0/w=0/d=0
aesni-write: (groupid=0, jobs=1): err= 0: pid=27851
  write: io=360032KB, bw=409635 B/s, iops=25 , runt=900002msec
    slat (usec): min=21 , max=11104 , avg=33.93, stdev=102.94
    clat (usec): min=399 , max=147821 , avg=4807.04, stdev=8795.94
     lat (usec): min=433 , max=147855 , avg=4842.43, stdev=8799.98
    clat percentiles (usec):
     |  1.00th=[  414],  5.00th=[  422], 10.00th=[  426], 20.00th=[  434],
     | 30.00th=[  446], 40.00th=[  486], 50.00th=[ 1004], 60.00th=[ 2384],
     | 70.00th=[ 4048], 80.00th=[ 6496], 90.00th=[14016], 95.00th=[23168],
     | 99.00th=[40704], 99.50th=[47872], 99.90th=[81408]
    bw (KB/s)  : min=  290, max=  536, per=25.01%, avg=400.13, stdev=19.09
    lat (usec) : 500=40.82%, 750=6.43%, 1000=2.68%
    lat (msec) : 2=7.35%, 4=12.45%, 10=17.33%, 20=6.38%, 50=6.13%
    lat (msec) : 100=0.37%, 250=0.05%
  cpu          : usr=0.06%, sys=0.31%, ctx=44705, majf=0, minf=49
  IO depths    : 1=98.7%, 2=1.3%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=22502/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=1406.4MB, aggrb=1600KB/s, minb=409KB/s, maxb=1228KB/s, mint=900017msec, maxt=900019msec
  WRITE: io=1406.4MB, aggrb=1600KB/s, minb=409KB/s, maxb=1228KB/s, mint=900002msec, maxt=900004msec

Disk stats (read/write):
  xvdd: ios=22497/67847, merge=0/179, ticks=268412/223324, in_queue=491701, util=37.60%
  xvde: ios=67488/22854, merge=0/177, ticks=778041/117628, in_queue=895667, util=67.50%